{
  "common": {
    "welcome": "Welcome to my portfolio",
    "downloadCV": "Download CV",
    "viewProjects": "View Projects",
    "contactMe": "Contact Me",
    "destroy_button": "Destroy Page",
    "warning_title": "Warning!",
    "warning_message": "This feature will run a 3D simulation that may not be supported by all devices due to graphics requirements.",
    "cancel": "Cancel",
    "continue": "Continue"
  },
  "blackHole": {
    "interactionMessage": "You can interact with the black hole",
    "restoreButton": "Restore Page"
  },
  "home": {
    "title": "Exploring the code universe"
  },
  "about": {
    "title": "<About Me/>",
    "desc1": "I’m a developer with a strong interest in web development, especially with React and Node.js/Next.js.",
    "desc2": "I studied Software Development and I’m currently pursuing a degree in Software Engineering.",
    "desc3": "I’m always looking to learn, <blue>build new projects</blue>, and explore <purple>new technologies</purple>.",
    "desc4": "I see myself as <blue>curious</blue>, <red>creative</red>, and eager to <purple>break tradition</purple>.",
    "cardHint": "Click or tap the card to see the other side."
  },
  "skills": {
    "title": "Skills",
    "close": "Close",
    "level": "Level",
    "hint": "Not sure what something is? Click to learn more!",
    "react": "React is a tool that helps build websites like if they were made of reusable building blocks. In this portfolio, it's what makes each section (like skills, contact, or projects) appear and work smoothly.",
    "javascript": "JavaScript is a language that makes websites interactive — like handling buttons, forms, and animations. This site uses it to make things respond when you click or scroll.",
    "nodejs": "Node.js allows using web technologies outside the browser — like running tools on a computer or server. It's not visible on this page, but it's part of the tools used to build and manage the project.",
    "html": "HTML is what gives structure to any webpage — like saying 'this is a title', 'this is an image', etc. Every section you see here is based on this structure, built through React.",
    "css": "CSS makes websites look nice — it defines colors, spacing, and sizes. This portfolio uses a modern style system called Tailwind CSS to control all the visual aspects.",
    "git": "Git is like a time machine for code — it keeps track of changes and helps developers work together. This portfolio uses Git to stay organized and backed up while it's built.",
    "supabase": "Supabase is an online service that stores and sends data for websites. In this portfolio, it can be used to show dynamic content or manage future updates securely.",
    "prisma": "Prisma helps websites talk to databases in a safe and simple way. It's not used directly in this portfolio, but it's a tool I use in other projects with more complex data.",
    "uiux": "UI/UX means how a site looks (UI: user interface) and how it feels to use (UX: user experience). This portfolio was designed to be easy to navigate, readable, and visually pleasant for all visitors."
  },
  "contact": {
    "title": "Get in Touch",
    "connect": "Connect With Me",
    "name": "Your Name",
    "email": "Your Email",
    "message": "Your Message",
    "send": "Send Message",
    "sent": "Message Sent!",
    "sending": "Sending...",
    "success": "Message sent successfully! I'll get back to you soon.",
    "footer": "Prefer direct contact? Use any of the methods above.",
     "githubRepo": "Portfolio GitHub Repository",
    "validation": {
      "required": "All fields are required",
      "invalid_email": "Please enter a valid email address",
      "short_message": "Message should be at least 10 characters long"
    },
    "error": {
      "general": "Failed to send message. Please try again later.",
      "configuration": "Form configuration error"
    }
  },
  "projects": {
    "title": "Projects",
    "subtitle": "Click any project to explore its mission.",
    "cetiMarket": {
      "title": "CETI Market",
      "description": "PWA for buying and selling school materials, built with React, Node.js, PostgreSQL, and real-time chat."
    },
    "mazamitlaCabins": {
      "title": "Mazamitla Cabins",
      "description": "Informative website for cabin rentals in Mazamitla with dynamic filters and WhatsApp booking integration."
    },
    "status": {
      "completed": "Completed",
      "in-progress": "In Progress",
      "upcoming": "Upcoming"
    },
    "github": "Code",
    "demo": "Demo"
  },
  "technologies": {
    "react": "React",
    "tailwind": "Tailwind CSS",
    "nodejs": "Node.js",
    "socketio": "Socket.io",
    "postgresql": "PostgreSQL",
    "prisma": "Prisma ORM",
    "googleVision": "Google Cloud Vision API",
    "paypal": "PayPal API",
    "pwa": "Progressive Web App",
    "vercel": "Vercel Hosting",
    "css": "CSS",
    "supabase": "Supabase"
  },
  "projectDetails": {
    "back": "Back to projects",
    "details": "Project Details",
    "github": "View Code",
    "githubUnavailable": "Code not available for this project",
    "demo": "View Project",
    "demoUnavailable": "Demo not available for this project",
    "notHostedNote": "Projects not marked as completed are not hosted yet.",
    "techStack": "Technology Stack",
    "clickToZoom": "Click to zoom",
    "features": {
      "title": "Main Features"
    },
    "type": {
      "school": "School Project",
      "freelance": "Freelance Project"
    },
    "cetiMarket": {
      "longDescription": "CETIMARKET is a progressive web application developed as a school project at CETI Colomos. It facilitates the buying, selling, and donating of school supplies among students, promoting circular economy and reuse. The platform offers secure authentication exclusively for CETI Colomos users, advanced product search, a dynamic shopping cart, secure payments through PayPal integration, and a rating and review system. Additionally, it features language switching between Spanish and English, real-time notifications for chat, questions, and transactions, as well as options to increase or decrease font size and change platform colors to improve accessibility for people with different types of color blindness. It incorporates Google Vision API to automatically moderate and classify uploaded images, ensuring community-appropriate content, along with a custom system that blocks inappropriate words in the questions section and chat. I would like to give special credit to my partner Ramiro Escalante, with whom I jointly developed this project.",
      "features": {
        "auth": "Secure authentication for CETI Colomos users only",
        "search": "Advanced product search and filtering",
        "cart": "Dynamic shopping cart",
        "paypal": "Secure payments via PayPal integration",
        "rating": "Rating and review system",
        "vision": "Automatic image moderation with Google Vision API",
        "language": "Language switching between Spanish and English",
        "notifications": "Real-time notifications for chat, questions, and transactions",
        "accessibility": "Font size adjustment and color settings for color blindness"
      }
    },
    "mazamitlaCabins": {
      "longDescription": "Informative website for cabin rentals in Mazamitla, built with React, JavaScript, and Tailwind CSS. Targeted at tourists and direct clients, it provides clear details on cabin capacities, services, and amenities. Features a dynamic filter by number of guests and a customized WhatsApp contact button with an automatic message. The design reflects the natural, peaceful forest environment through a green and brown color palette and subtle animations to enhance user experience without sacrificing clarity. The architecture uses Prisma with PostgreSQL for data management, accessed efficiently via Supabase from the frontend. Hosted on Vercel for fast, reliable deployment and scalability. Security and privacy were prioritized, with certain internal functions reserved to protect business information. In summary, this is a simple yet functional platform that helps visitors easily find and book comfortable lodging in harmony with nature.",
      "features": {
        "calendar": "Dynamic filter by number of guests",
        "booking": "Custom WhatsApp contact button with automatic message",
        "management": "Secure data management with Prisma and PostgreSQL",
        "search": "Efficient querying via Supabase",
        "confirmation": "Fast and reliable deployment on Vercel"
      }
    }
  }
}