{
  "common": {
    "welcome": "Bienvenido a mi portafolio",
    "downloadCV": "Descargar CV",
    "viewProjects": "Ver Proyectos",
    "contactMe": "Contáctame"
  },
  "home": {
    "title": "SystemX25: Fragmentado, estelar, impredecible",
    "subtitle": "Explorando el universo del código"
  },
  "about": {
    "title": "<Sobre mí/>",
    "desc1": "Soy desarrollador con un gran interés en el desarrollo web, especialmente usando React y Node.js/Next.js.",
    "desc2": "Estudié la carrera de Tecnólogo en Desarrollo de Software y actualmente curso la Ingeniería en Desarrollo de Software.",
    "desc3": "Me interesa seguir aprendiendo, <blue>crear más proyectos</blue> y explorar <purple>nuevas tecnologías</purple>.",
    "desc4": "Me considero <blue>curioso</blue>, <red>creativo</red> y con ganas de <purple>romper lo tradicional</purple>."
  },
  "skills": {
    "title": "Habilidades",
    "close": "Cerrar",
    "level": "Nivel",
    "hint": "¿No sabes qué es alguna? ¡Haz clic para más info!",
    "react": "React es una herramienta para construir páginas web como si fueran piezas que se pueden reutilizar. En este portafolio, se usa para mostrar secciones como habilidades, contacto o proyectos de forma fluida.",
    "javascript": "JavaScript es un lenguaje que permite que las páginas web respondan a lo que hace el usuario, como clics, formularios o animaciones. Aquí se usa para que el sitio sea interactivo y dinámico.",
    "nodejs": "Node.js permite usar herramientas web fuera del navegador, como en un servidor o computadora. Aunque no lo ves directamente en esta página, ayuda a desarrollar y mantener el proyecto.",
    "html": "HTML es lo que da estructura a cualquier página web, como decir 'esto es un título', 'esto es una imagen', etc. Todas las secciones que ves aquí están construidas con esa base.",
    "css": "CSS es lo que hace que las páginas se vean bien: define colores, tamaños, espacios, etc. Este portafolio usa Tailwind CSS, un sistema moderno para manejar los estilos.",
    "git": "Git es como una máquina del tiempo para el código: guarda los cambios y permite colaborar con otras personas. Aquí se usa para organizar y proteger el desarrollo del sitio.",
    "supabase": "Supabase es un servicio en línea que guarda y envía información a las páginas web. En este portafolio, permite mostrar contenido dinámico y manejar datos de forma segura.",
    "prisma": "Prisma ayuda a que las páginas se conecten con bases de datos de manera sencilla y segura. No se usa directamente aquí, pero sí en otros proyectos más complejos que desarrollo.",
    "uiux": "UI/UX se refiere a cómo se ve un sitio (UI: interfaz) y cómo se siente usarlo (UX: experiencia). Este portafolio fue diseñado para que navegarlo sea fácil, claro y agradable para cualquier persona."
  },
  "contact": {
    "title": "Contacto",
    "name": "Tu Nombre",
    "email": "Tu Email",
    "message": "Tu Mensaje",
    "send": "Enviar Mensaje",
    "success": "¡Mensaje enviado con éxito!"
  }
}