{
  "common": {
    "welcome": "Bienvenido a mi portafolio",
    "downloadCV": "Descargar CV",
    "viewProjects": "Ver Proyectos",
    "contactMe": "Contáctame"
  },
  "home": {
    "title": "Explorando el universo del código"
  },
  "about": {
    "title": "<Sobre Mí/>",
    "desc1": "Soy un desarrollador con gran interés en el desarrollo web, especialmente con React y Node.js/Next.js.",
    "desc2": "Estudié Desarrollo de Software y actualmente curso la carrera de Ingeniería en Software.",
    "desc3": "Siempre busco aprender, <blue>crear nuevos proyectos</blue> y explorar <purple>nuevas tecnologías</purple>.",
    "desc4": "Me veo como <blue>curioso</blue>, <red>creativo</red> y con ganas de <purple>romper con la tradición</purple>.",
    "cardHint": "Haz clic o toca la tarjeta para ver el otro lado."
  },
  "skills": {
    "title": "Habilidades",
    "close": "Cerrar",
    "level": "Nivel",
    "hint": "¿No sabes qué es algo? ¡Haz clic para saber más!",
    "react": "React es una herramienta que ayuda a construir sitios web como si estuvieran hechos de bloques reutilizables. En este portafolio, es lo que hace que cada sección (como habilidades, contacto o proyectos) aparezca y funcione suavemente.",
    "javascript": "JavaScript es un lenguaje que hace que los sitios web sean interactivos — como manejar botones, formularios y animaciones. Este sitio lo usa para responder cuando haces clic o desplazas.",
    "nodejs": "Node.js permite usar tecnologías web fuera del navegador — como ejecutar herramientas en una computadora o servidor. No es visible en esta página, pero es parte de las herramientas para construir y gestionar el proyecto.",
    "html": "HTML da estructura a cualquier página web — como decir 'esto es un título', 'esta es una imagen', etc. Cada sección que ves aquí está basada en esta estructura, construida con React.",
    "css": "CSS hace que los sitios se vean bonitos — define colores, espacios y tamaños. Este portafolio usa un sistema moderno llamado Tailwind CSS para controlar todos los aspectos visuales.",
    "git": "Git es como una máquina del tiempo para el código — mantiene el registro de cambios y ayuda a los desarrolladores a trabajar juntos. Este portafolio usa Git para mantenerse organizado y respaldado mientras se construye.",
    "supabase": "Supabase es un servicio en línea que almacena y envía datos para sitios web. En este portafolio, puede usarse para mostrar contenido dinámico o gestionar actualizaciones futuras de forma segura.",
    "prisma": "Prisma ayuda a los sitios web a hablar con bases de datos de manera segura y sencilla. No se usa directamente en este portafolio, pero es una herramienta que uso en otros proyectos con datos más complejos.",
    "uiux": "UI/UX significa cómo se ve un sitio (UI: interfaz de usuario) y cómo se siente al usarlo (UX: experiencia de usuario). Este portafolio fue diseñado para ser fácil de navegar, legible y visualmente agradable para todos los visitantes."
  },
  "contact": {
    "title": "Ponte en contacto",
    "name": "Tu Nombre",
    "email": "Tu Correo",
    "message": "Tu Mensaje",
    "send": "Enviar Mensaje",
    "success": "¡Mensaje enviado con éxito!"
  },
  "projects": {
    "title": "Proyectos",
    "subtitle": "Haz clic en cualquier proyecto para explorar su misión.",
    "cetiMarket": {
      "title": "CETI Market",
      "description": "PWA para compra y venta de materiales escolares, construido con React, Node.js, PostgreSQL y chat en tiempo real."
    },
    "mazamitlaCabins": {
      "title": "Cabañas Mazamitla",
      "description": "Sitio web informativo para renta de cabañas en Mazamitla con filtros dinámicos e integración de reservas por WhatsApp."
    },
    "status": {
      "completed": "Completado",
      "in-progress": "En progreso",
      "upcoming": "Planeado"
    },
    "github": "Código",
    "demo": "Demo"
  },
  "technologies": {
    "react": "React",
    "tailwind": "Tailwind CSS",
    "nodejs": "Node.js",
    "socketio": "Socket.io",
    "postgresql": "PostgreSQL",
    "prisma": "Prisma ORM",
    "googleVision": "Google Cloud Vision API",
    "paypal": "PayPal API",
    "pwa": "Aplicación Web Progresiva",
    "vercel": "Hosting en Vercel"
  }
}