{
  "common": {
    "welcome": "Bienvenido a mi portafolio",
    "downloadCV": "Descargar CV",
    "viewProjects": "Ver Proyectos",
    "contactMe": "Contáctame",
    "destroy_button": "Destruir página",
    "warning_title": "¡Advertencia!",
    "warning_message": "Esta función ejecutará una simulación 3D que podría no ser compatible con todos los dispositivos debido a requisitos gráficos.",
    "cancel": "Cancelar",
    "continue": "Continuar"
  },
  "blackHole": {
    "interactionMessage": "Puedes interactuar con el agujero negro",
    "restoreButton": "Restaurar página"
  },
  "home": {
    "title": "Explorando el universo del código"
  },
  "about": {
    "title": "<Sobre Mí/>",
    "desc1": "Soy un desarrollador con gran interés en el desarrollo web, especialmente con React y Node.js/Next.js.",
    "desc2": "Estudié Desarrollo de Software y actualmente curso la carrera de Ingeniería en Software.",
    "desc3": "Siempre busco aprender, <blue>crear nuevos proyectos</blue> y explorar <purple>nuevas tecnologías</purple>.",
    "desc4": "Me veo como <blue>curioso</blue>, <red>creativo</red> y con ganas de <purple>romper con la tradición</purple>.",
    "cardHint": "Haz clic o toca la tarjeta para ver el otro lado."
  },
  "skills": {
    "title": "Habilidades",
    "close": "Cerrar",
    "level": "Nivel",
    "hint": "¿No sabes qué es algo? ¡Haz clic para saber más!",
    "react": "React es una herramienta que ayuda a construir sitios web como si estuvieran hechos de bloques reutilizables. En este portafolio, es lo que hace que cada sección (como habilidades, contacto o proyectos) aparezca y funcione suavemente.",
    "javascript": "JavaScript es un lenguaje que hace que los sitios web sean interactivos — como manejar botones, formularios y animaciones. Este sitio lo usa para responder cuando haces clic o desplazas.",
    "nodejs": "Node.js permite usar tecnologías web fuera del navegador — como ejecutar herramientas en una computadora o servidor. No es visible en esta página, pero es parte de las herramientas para construir y gestionar el proyecto.",
    "html": "HTML da estructura a cualquier página web — como decir 'esto es un título', 'esta es una imagen', etc. Cada sección que ves aquí está basada en esta estructura, construida con React.",
    "css": "CSS hace que los sitios se vean bonitos — define colores, espacios y tamaños. Este portafolio usa un sistema moderno llamado Tailwind CSS para controlar todos los aspectos visuales.",
    "git": "Git es como una máquina del tiempo para el código — mantiene el registro de cambios y ayuda a los desarrolladores a trabajar juntos. Este portafolio usa Git para mantenerse organizado y respaldado mientras se construye.",
    "supabase": "Supabase es un servicio en línea que almacena y envía datos para sitios web. En este portafolio, puede usarse para mostrar contenido dinámico o gestionar actualizaciones futuras de forma segura.",
    "prisma": "Prisma ayuda a los sitios web a hablar con bases de datos de manera segura y sencilla. No se usa directamente en este portafolio, pero es una herramienta que uso en otros proyectos con datos más complejos.",
    "uiux": "UI/UX significa cómo se ve un sitio (UI: interfaz de usuario) y cómo se siente al usarlo (UX: experiencia de usuario). Este portafolio fue diseñado para ser fácil de navegar, legible y visualmente agradable para todos los visitantes."
  },
  "contact": {
    "title": "Contáctame",
    "connect": "Conéctate Conmigo",
    "name": "Tu Nombre",
    "email": "Tu Correo Electrónico",
    "message": "Tu Mensaje",
    "send": "Enviar Mensaje",
    "sent": "¡Mensaje Enviado!",
    "sending": "Enviando...",
    "success": "¡Mensaje enviado con éxito! Te responderé pronto.",
    "footer": "¿Prefieres contacto directo? Usa cualquiera de los métodos arriba.",
    "githubRepo": "Repositorio GitHub del portafolio",
    "validation": {
      "required": "Todos los campos son obligatorios",
      "invalid_email": "Por favor ingresa un correo electrónico válido",
      "short_message": "El mensaje debe tener al menos 10 caracteres"
    },
    "error": {
      "general": "Error al enviar el mensaje. Por favor inténtalo más tarde.",
      "configuration": "Error de configuración del formulario"
    }
  },
  "projects": {
    "title": "Proyectos",
    "subtitle": "Haz clic en cualquier proyecto para explorar su misión.",
    "cetiMarket": {
      "title": "CETI Market",
      "description": "PWA para compra y venta de materiales escolares, construido con React, Node.js, PostgreSQL y chat en tiempo real."
    },
    "mazamitlaCabins": {
      "title": "Cabañas Mazamitla",
      "description": "Sitio web informativo para renta de cabañas en Mazamitla con filtros dinámicos e integración de reservas por WhatsApp."
    },
    "status": {
      "completed": "Completado",
      "in-progress": "En progreso",
      "upcoming": "Planeado"
    },
    "github": "Código",
    "demo": "Demo"
  },
  "technologies": {
    "react": "React",
    "tailwind": "Tailwind CSS",
    "nodejs": "Node.js",
    "socketio": "Socket.io",
    "postgresql": "PostgreSQL",
    "prisma": "Prisma ORM",
    "googleVision": "Google Cloud Vision API",
    "paypal": "PayPal API",
    "pwa": "Aplicación Web Progresiva",
    "vercel": "Hosting en Vercel",
    "css": "CSS",
    "supabase": "Supabase"
  },
  "projectDetails": {
    "back": "Volver a proyectos",
    "details": "Detalles del Proyecto",
    "github": "Ver Código",
    "githubUnavailable": "Código no disponible para este proyecto",
    "demo": "Ver Proyecto",
    "notHostedNote": "Los proyectos no marcados como completados aún no están hosteados.",
    "demoUnavailable": "Demo no disponible para este proyecto",
    "techStack": "Stack Tecnológico",
    "clickToZoom": "Haz clic para ampliar",
    "features": {
      "title": "Funciones Principales"
    },
    "type": {
      "school": "Proyecto escolar",
      "freelance": "Proyecto freelance"
    },
    "cetiMarket": {
      "longDescription": "CETIMARKET es una aplicación web progresiva desarrollada como proyecto escolar en el CETI Colomos. Facilita la compra, venta y donación de materiales escolares entre estudiantes, promoviendo la economía circular y la reutilización. La plataforma ofrece autenticación segura exclusiva para usuarios del CETI Colomos, búsqueda avanzada de productos, carrito de compras dinámico, integración con PayPal para pagos seguros, y un sistema de calificaciones y comentarios. Además, cuenta con cambio de idioma entre español e inglés, notificaciones en tiempo real para chat, preguntas y transacciones, así como opciones para aumentar o disminuir el tamaño de letra y cambiar los colores de la plataforma para mejorar la accesibilidad a personas con diferentes tipos de daltonismo. Incorpora Google Vision API para moderar y clasificar automáticamente las imágenes subidas, asegurando contenido apropiado para la comunidad, junto con un sistema personalizado que bloquea palabras inapropiadas en la sección de preguntas y el chat. Quiero dar crédito especial a mi compañero Ramiro Escalante, con quien desarrollé este proyecto en conjunto.",
      "features": {
        "auth": "Autenticación segura para usuarios del CETI Colomos",
        "search": "Búsqueda avanzada y filtrado de productos",
        "cart": "Carrito de compras dinámico",
        "paypal": "Pagos seguros mediante integración con PayPal",
        "rating": "Sistema de calificaciones y comentarios",
        "vision": "Moderación automática de imágenes con Google Vision API",
        "language": "Cambio de idioma entre español e inglés",
        "notifications": "Notificaciones en tiempo real para chat, preguntas y transacciones",
        "accessibility": "Ajustes de tamaño de letra y colores para daltonismo"
      }
    },
    "mazamitlaCabins": {
      "longDescription": "Página informativa para renta de cabañas en Mazamitla, desarrollada con React, JavaScript y Tailwind CSS. Dirigida a turistas y clientes directos, ofrece detalles claros sobre capacidades, servicios y comodidades de cada cabaña. Cuenta con filtro dinámico por número de personas y botón de WhatsApp para contacto rápido con mensaje automático. El diseño evoca la naturaleza y tranquilidad del entorno boscoso, con paleta de verdes y cafés, y animaciones sutiles para mejorar la experiencia sin perder claridad. La arquitectura usa Prisma con PostgreSQL para gestionar datos, accedidos desde el frontend vía Supabase, y el proyecto está alojado en Vercel para rendimiento y escalabilidad. Se priorizó la seguridad y privacidad, reservando funciones internas para proteger la información. En resumen, es una plataforma sencilla y funcional que facilita a los visitantes encontrar y reservar hospedaje cómodo y en armonía con la naturaleza.",
      "features": {
        "calendar": "Filtro dinámico por número de personas",
        "booking": "Botón personalizado de contacto por WhatsApp con mensaje automático",
        "management": "Gestión segura de datos con Prisma y PostgreSQL",
        "search": "Consulta eficiente mediante Supabase",
        "confirmation": "Despliegue rápido y confiable en Vercel"
      }
    }
  }
}